In [1]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [2]:
salary=Series([50000,70000,30000,45000,55000,60000,40000],index=['Masum','Sifat','Babu','Ritu','Nitu','Jit','Ram'])

In [3]:
salary

Masum    50000
Sifat    70000
Babu     30000
Ritu     45000
Nitu     55000
Jit      60000
Ram      40000
dtype: int64

In [4]:
salary.Babu

30000

In [5]:
salary[['Babu','Ram']]

Babu    30000
Ram     40000
dtype: int64

In [6]:
salary[salary>35000]

Masum    50000
Sifat    70000
Ritu     45000
Nitu     55000
Jit      60000
Ram      40000
dtype: int64

# Import data

In [7]:
file=pd.read_csv('sample.csv')

In [8]:
file

    value 1  value 2
0         1        3
1         2        4
2         3        5
3         4        6
4         5        5
5         6        8
6         7        7
7         8       10
8         9       10
9        10        9
10       11       10

In [9]:
file.columns

Index(['value 1', 'value 2'], dtype='object')

# To generate Dataframe

In [10]:
df=DataFrame(file,columns=['value 1', 'value 2'])

In [11]:
df

    value 1  value 2
0         1        3
1         2        4
2         3        5
3         4        6
4         5        5
5         6        8
6         7        7
7         8       10
8         9       10
9        10        9
10       11       10

# Creating new series with df

In [12]:
new_sample=Series(['Dhaka','Sylhet','Rajshahi','Khulna','Chitagong'])

In [13]:
new_sample

0        Dhaka
1       Sylhet
2     Rajshahi
3       Khulna
4    Chitagong
dtype: object

# To add value in df

In [14]:
df['value 1']=new_sample

In [15]:
df

      value 1  value 2
0       Dhaka        3
1      Sylhet        4
2    Rajshahi        5
3      Khulna        6
4   Chitagong        5
5         NaN        8
6         NaN        7
7         NaN       10
8         NaN       10
9         NaN        9
10        NaN       10

In [16]:
df['value 2']=new_sample
df

      value 1    value 2
0       Dhaka      Dhaka
1      Sylhet     Sylhet
2    Rajshahi   Rajshahi
3      Khulna     Khulna
4   Chitagong  Chitagong
5         NaN        NaN
6         NaN        NaN
7         NaN        NaN
8         NaN        NaN
9         NaN        NaN
10        NaN        NaN

# customize Dataframe

In [17]:
nan=np.nan

In [18]:
df2=DataFrame({'catagory':(['electronics','mens clothings','womens clothings']),
              'sales-in-units':np.array([nan,3,5]),'date':pd.Timestamp('20220316'),
               '# of customers':np.array([nan,nan,nan])})

In [19]:
df2

           catagory  sales-in-units       date  # of customers
0       electronics             NaN 2022-03-16             NaN
1    mens clothings             3.0 2022-03-16             NaN
2  womens clothings             5.0 2022-03-16             NaN

# Deleting missing data column

In [20]:
df2.dropna(axis=1)

           catagory       date
0       electronics 2022-03-16
1    mens clothings 2022-03-16
2  womens clothings 2022-03-16

In [21]:
df2.dropna(axis=1,how='all')

           catagory  sales-in-units       date
0       electronics             NaN 2022-03-16
1    mens clothings             3.0 2022-03-16
2  womens clothings             5.0 2022-03-16

In [22]:
df2.dropna(axis=1,how='any')

           catagory       date
0       electronics 2022-03-16
1    mens clothings 2022-03-16
2  womens clothings 2022-03-16

In [23]:
df2.dropna(how='any')

Empty DataFrame
Columns: [catagory, sales-in-units, date, # of customers]
Index: []

# Merging DataFrame

In [24]:
left_df2=DataFrame({'catagory':(['electronics','mens clothings','womens clothings']),
              'sales-in-units':np.array([7,3,5])})
right_df2=DataFrame({'catagory':(['electronics','mens clothings','womens clothings']),
              'sales-in-units':np.array([11,8,2])})

In [25]:
df3=pd.merge(left_df2,right_df2,on='catagory',how='left')
df3

           catagory  sales-in-units_x  sales-in-units_y
0       electronics                 7                11
1    mens clothings                 3                 8
2  womens clothings                 5                 2

# Replacing Column

In [26]:
df4=DataFrame({'one':pd.Series([5,6,7,8,9],index=['a','b','c','d','e']),
              'two':pd.Series([10,11,12,13,14],index=['f','g','m','n','p'])})

In [27]:
df4

   one   two
a  5.0   NaN
b  6.0   NaN
c  7.0   NaN
d  8.0   NaN
e  9.0   NaN
f  NaN  10.0
g  NaN  11.0
m  NaN  12.0
n  NaN  13.0
p  NaN  14.0

In [28]:
df4.replace(7,15)

    one   two
a   5.0   NaN
b   6.0   NaN
c  15.0   NaN
d   8.0   NaN
e   9.0   NaN
f   NaN  10.0
g   NaN  11.0
m   NaN  12.0
n   NaN  13.0
p   NaN  14.0

In [29]:
df4.replace([5,11],[20,20])

    one   two
a  20.0   NaN
b   6.0   NaN
c   7.0   NaN
d   8.0   NaN
e   9.0   NaN
f   NaN  10.0
g   NaN  20.0
m   NaN  12.0
n   NaN  13.0
p   NaN  14.0

# L===4

In [31]:
df5=DataFrame({'catagory':pd.Categorical(['electronics','mens clothings','womens clothings']),
              'sales-in-units':np.array([7,3,5])})

In [32]:
df5

           catagory  sales-in-units
0       electronics               7
1    mens clothings               3
2  womens clothings               5

# To add or create column

In [33]:
new_col={'electronics':'21','mens clothings':'24','womens clothings':'19'}

In [35]:
df5['# of customera']=df5['catagory'].map(new_col)
df5

           catagory  sales-in-units # of customera
0       electronics               7             21
1    mens clothings               3             24
2  womens clothings               5             19

# Order in columns

In [37]:
df5=df5[['# of customera','catagory','sales-in-units']]
df5

  # of customera          catagory  sales-in-units
0             21       electronics               7
1             24    mens clothings               3
2             19  womens clothings               5

# Adding timestamp

In [42]:
a=pd.Timestamp('20220316')
a

Timestamp('2022-03-16 00:00:00')

In [43]:
b=[pd.Timestamp('20220316'),pd.Timestamp('20220317'),pd.Timestamp('20220318')]
b

[Timestamp('2022-03-16 00:00:00'),
 Timestamp('2022-03-17 00:00:00'),
 Timestamp('2022-03-18 00:00:00')]

In [45]:
c=pd.Series(np.random.randint(3),b)
c

2022-03-16    1
2022-03-17    1
2022-03-18    1
dtype: int64

In [47]:
index=pd.date_range('20220316','20220319',freq='H')
index

DatetimeIndex(['2022-03-16 00:00:00', '2022-03-16 01:00:00',
               '2022-03-16 02:00:00', '2022-03-16 03:00:00',
               '2022-03-16 04:00:00', '2022-03-16 05:00:00',
               '2022-03-16 06:00:00', '2022-03-16 07:00:00',
               '2022-03-16 08:00:00', '2022-03-16 09:00:00',
               '2022-03-16 10:00:00', '2022-03-16 11:00:00',
               '2022-03-16 12:00:00', '2022-03-16 13:00:00',
               '2022-03-16 14:00:00', '2022-03-16 15:00:00',
               '2022-03-16 16:00:00', '2022-03-16 17:00:00',
               '2022-03-16 18:00:00', '2022-03-16 19:00:00',
               '2022-03-16 20:00:00', '2022-03-16 21:00:00',
               '2022-03-16 22:00:00', '2022-03-16 23:00:00',
               '2022-03-17 00:00:00', '2022-03-17 01:00:00',
               '2022-03-17 02:00:00', '2022-03-17 03:00:00',
               '2022-03-17 04:00:00', '2022-03-17 05:00:00',
               '2022-03-17 06:00:00', '2022-03-17 07:00:00',
               '2022-03-17 08:00:00', '2022-03-17 09:00:00',
               '2022-03-17 10:00:00', '2022-03-17 11:00:00',
               '2022-03-17 12:00:00', '2022-03-17 13:00:00',
               '2022-03-17 14:00:00', '2022-03-17 15:00:00',
               '2022-03-17 16:00:00', '2022-03-17 17:00:00',
               '2022-03-17 18:00:00', '2022-03-17 19:00:00',
               '2022-03-17 20:00:00', '2022-03-17 21:00:00',
               '2022-03-17 22:00:00', '2022-03-17 23:00:00',
               '2022-03-18 00:00:00', '2022-03-18 01:00:00',
               '2022-03-18 02:00:00', '2022-03-18 03:00:00',
               '2022-03-18 04:00:00', '2022-03-18 05:00:00',
               '2022-03-18 06:00:00', '2022-03-18 07:00:00',
               '2022-03-18 08:00:00', '2022-03-18 09:00:00',
               '2022-03-18 10:00:00', '2022-03-18 11:00:00',
               '2022-03-18 12:00:00', '2022-03-18 13:00:00',
               '2022-03-18 14:00:00', '2022-03-18 15:00:00',
               '2022-03-18 16:00:00', '2022-03-18 17:00:00',
               '2022-03-18 18:00:00', '2022-03-18 19:00:00',
               '2022-03-18 20:00:00', '2022-03-18 21:00:00',
               '2022-03-18 22:00:00', '2022-03-18 23:00:00',
               '2022-03-19 00:00:00'],
              dtype='datetime64[ns]', freq='H')